# -----------------------------------------------------= Задача 2 =-----------------------------------------------------
# 2. Kirjuta kõigepealt funktsioon, mis võtab argumendiks kuu numbri ja tagastab vastava kuu nime (väikeste tähtedega).
# Testi oma funktsiooni. Seejärel lisa programmi laused, mis küsivad kasutajalt kuu numbri ja väljastavad vastava kuu
# nime suurte tähtedega.
# 2. Сначала напишите функцию, которая принимает в качестве аргумента номер месяца и возвращает название
# соответствующего месяца (строчными буквами). Проверьте свою функцию. Затем добавьте операторы программы, которые
# запрашивают у пользователя номер месяца и выводят соответствующее название месяца заглавными буквами.
# ----------------------------------------------------------------------------------------------------------------------