# -----------------------------------------------------= Задача 3 =-----------------------------------------------------
# 3. Kirjuta funktsioon kuupäev_sõnena, mis võtab argumentideks päeva, kuu ja aasta (arvudena) ning tagastab sõne, mis
# esitab kuupäeva kujul <päev>. <kuu nimi> <aasta> (nt. 24. veebruar 1918). Seejärel kirjuta programm, mis küsib
# kasutajalt arvudena päeva, kuu ja aasta ning kuvab ekraanile vastava kuupäeva sõnena.
# 3. Напишите функцию в виде строки_даты, которая принимает день, месяц и год (в виде чисел) в качестве аргументов и
# возвращает строку, представляющую дату в форме <день>. <название месяца> <год> (например, 24 февраля 1918 г.). Затем
# напишите программу, которая запрашивает у пользователя день, месяц и год в виде чисел и отображает соответствующую
# дату на экране в виде слова.
# ----------------------------------------------------------------------------------------------------------------------