# --------------------= 1. ЗАДАЧА «РЯД - 1» =--------------------
'''Даны два целых числа A и B (при этом A ≤ B). Выведите все числа от A до B включительно.'''




# --------------------= 2. ЗАДАЧА «РЯД - 2» =--------------------
'''Даны два целых числа A и В. Выведите все числа от A до B включительно, в порядке возрастания,
если A < B, или в порядке убывания в противном случае.'''




# --------------------= 3. ЗАДАЧА «РЯД - 3» =--------------------
'''Даны два целых числа A и В, A>B. Выведите все нечётные числа от A до B включительно. В этой
задаче нельзя использовать инструкцию if в теле цикла.'''




# --------------------= 4. ЗАДАЧА «СУММА ДЕСЯТИ ЧИСЕЛ» =--------------------
'''Дано 10 целых чисел. Числа сгенерированы случайным образом. Вычислите их сумму.'''




# --------------------= 5. ЗАДАЧА «СУММА N ЧИСЕЛ» =--------------------
'''Сначала вводите количество чисел N, затем выводится на экран ровно N целых чисел
сгенерированных случайным образом. Вычислите их сумму.'''




# --------------------= 6. ЗАДАЧА «СУММА КУБОВ» =--------------------
'''По данному натуральном n вычислите сумму 13+23+33+...+n3.'''




# --------------------= 7. ЗАДАЧА «ФАКТОРИАЛ» =--------------------
'''Факториалом числа n называется произведение 1 × 2 × ... × n. Обозначение: n!.
По данному натуральному n вычислите значение n!. Пользоваться математической библиотекой
math в этой задаче запрещено.'''




# --------------------= 8. ЗАДАЧА «СУММА ФАКТОРИАЛОВ» =--------------------
'''По данному натуральному числу n вычислите сумму 1!+2!+3!+...+n!. В решении этой задачи
желательно использовать только один цикл.
Пользоваться математической библиотекой math в этой задаче запрещено.'''





# --------------------= 9. ЗАДАЧА «КОЛИЧЕСТВО НУЛЕЙ» =--------------------
'''Дано N чисел: сначала вводится число N, затем вводится ровно N целых чисел. Для ввода данных
предложите цикл – выход из цикла ввод пустой строки (нажатие ENTER).
Подсчитайте количество нулей среди введенных чисел и выведите это количество.'''






# --------------------= 10. ЗАДАЧА «ЛЕСЕНКА» =--------------------
'''По данному натуральному n ≤ 9 выведите лесенку из n ступенек, i-я ступенька состоит из чисел от
1 до i без пробелов (вложенные циклы).'''




# --------------------= 11. ЗАДАЧА «ПОТЕРЯННАЯ КАРТОЧКА» =--------------------
'''Для настольной игры используются карточки с номерами от 1 до N. Одна карточка потерялась.
Найдите ее, зная номера оставшихся карточек.
Дано число N, далее N − 1 номер оставшихся карточек (различные числа от 1 до N). Программа
должна вывести номер потерянной карточки (вложенные циклы).'''